#!/bin/bash

# 1. 假如脚本的参数是空， 则输出“参数不足，应该多于1个”(4种方法)
# 2. 设置一个变量num, 假如$1是空，则取$0, 不然取$1(3种方法)
# 3. 输入的数字是10-20(包含)之间， 就输出yes， 不然就输出no(3种方法)

# test -z $1 && echo "参数不足， 因该多于0个" || echo "参数是正确的"
[ -z $1 ] && echo "参数不足， 因该多于0个"
# [ "$1" == "" ] && echo "参数不足， 因该多于0个"
# [ "x$1" == "x" ]  && echo "参数不足， 因该多于0个"

# if test -z $1; then
    # echo "参数不足， 因该多于0个"
    # exit
# fi

# if [ -z $1 ]; then
    # echo "参数不足， 因该多于0个"
# fi

# if [ "$1" == ""  ]; then
    # echo "参数不足， 因该多于0个"
# fi

# if [ "*$1" == "*" ]; then
    # echo "参数不足， 因该多于0个"
# fi

# echo "参数是正确的"
# -------------------------------------------------------------------------------

# if test -z $1; then
    # num=$0
# else
    # num=$1
# fi

# echo "$num"

# test -z $1 && num=$0 || num=$1 && echo "$num"

# num=$"${1-$0}"
# echo $num

# if [ "$1" -ge 10 ] && [ "$1" -le 20 ]; then
    # echo "yes"
# else
    # echo "no"
# fi

# 会开新进程去判断
# [ "$1" -ge 10 -a "$1" -le 20 ] && echo "yes" || echo "no"

# 会判断是否是数字
(("$1" >= 10 && "$1" <= 20 )) && echo "yes" || echo "no"
