#!/bin/bash

method_1(){
echo "........."$(date +%F)"........."
r=$((RANDOM%15+6))
array=( ["6"]="陈群云" ["7"]="覃章成" ["8"]="唐旭" ["9"]="廖志航" \
        ["10"]="郭源"  ["11"]="刘楚锦" ["12"]="梁健" ["13"]="李卫兵" \
        ["14"]="许权鑫" ["15"]="颜树吉" ["16"]="全相华" ["17"]="莫敦惠" \
        ["18"]="黄树海" ["19"]="刘刚" ["20"]="谭志文" )
echo ${array["$r"]}
}

method_2(){
echo "........."$(date +%F)"........."
r=$((RANDOM%5+1))
array=( ["1"]="廖挺" ["2"]="叶星宇" ["3"]="陈仕杰" \
        ["4"]="陈龙" ["5"]="陈绪佳" )
echo ${array["$r"]}
}

num=$((RANDOM%10000+1))


while : ; do
    [[ $answer == "q" || $answer == "Q" ]] && echo "选出来了"  && exit
    if [[ $num < 100 ]] ; then
        method_2
    else
        method_1
    fi
    sleep 0.3
done

